app/views/messages/index.html.erb

<% @user = current_user %>
<% @user.messages.each do |message| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 3