app/views/messages/show.html.erb

    <% @user = current_user %>
    <% @messages = @user.messages.find(:all, :conditions => { :parent_id => @message.parent_id }) %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 3 AND "messages"."id" = ? LIMIT 1  [["id", "1"]]