app/views/horses/index.html.erb

SELECT "horses".* FROM "horses" WHERE "horses"."user_id" = 3
---
  <% @user = current_user %>
<% @user.horses.each do |horse| %>