app/views/horses/index.html.erb

<% @user.testimonials.each do |t| %>
<% @voucher = User.find(t.voucher_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1