app/views/users/show.html.erb

SELECT "horses".* FROM "horses" WHERE "horses"."user_id" = 3
---
  <% @user = current_user %>
  <% @user.saved_horses.each do |s| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
    <td></td>
    <td><%= link_to 'Add Note', user_horse_path(User.find(s.user_id), Horse.find(s.horse_id)) %></td>