app/views/home/index.html.erb

    <% @users.each do |user| %>
    <% user.horses.each do |horse| %>
---
SELECT "horses".* FROM "horses" WHERE "horses"."user_id" = 1