app/controllers/horses_controller.rb

  def index
      @user = User.find(params[:user_id])
      @horse = @user.horses.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "horses".* FROM "horses" WHERE "horses"."user_id" = 3

  def show
      @user = User.find(params[:user_id])
      @horse = @user.horses.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "horses".* FROM "horses" WHERE "horses"."user_id" = 3 AND "horses"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1

  def create
      @user = User.find(params[:user_id])
      @horse = @user.horses.build(params[:horse])

    respond_to do |format|
      if @horse.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "horses" ("age", "breed", "created_at", "gender", "height", "name", "price", "text_description", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
      @user = User.find(params[:user_id])
      @horse = @user.horses.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "horses".* FROM "horses" WHERE "horses"."user_id" = 3 AND "horses"."id" = ? LIMIT 1  [["id", "1"]]

  def update
      @user = User.find(params[:user_id])
      @horse = @user.horses.find(params[:id])

    respond_to do |format|
      if @horse.update_attributes(params[:horse])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "horses".* FROM "horses" WHERE "horses"."user_id" = 3 AND "horses"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "horses" SET "price" = 13000.0, "updated_at" = '2012-11-28 19:35:10.273110' WHERE "horses"."id" = 1

  def destroy
      @user = User.find(params[:user_id])
      @horse = @user.horses.find(params[:id])
      @horse.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "horses".* FROM "horses" WHERE "horses"."user_id" = 3 AND "horses"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "horses" WHERE "horses"."id" = ?  [["id", 1]]