app/controllers/messages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 3
---
    def index
        @user = User.find(params[:user_id])
        @message = @user.messages.all

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 3 AND "messages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
      @user = User.find(params[:user_id])
      @message = @user.messages.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def new
      @user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 3 AND "messages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
      @user = User.find(params[:user_id])
      if :id.nil?
      else
      @message = @user.messages.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "messages" ("content", "created_at", "from_name", "title", "to_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
      if params[:save_button]
      @user = User.find(params[:user_id])
      @message = @user.messages.build(params[:message])
      @message.folder = "drafts"
        respond_to do |format|
          if @message.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 3 AND "messages"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "messages" SET "content" = 'test message edit', "updated_at" = '2012-11-28 17:14:37.857630' WHERE "messages"."id" = 1
---
  def update
    if params[:send_button]
      @sender = User.find(params[:user_id])
      @message_sent = @sender.messages.find(params[:id])
      @recipient = User.find(@message_sent.to_user_id)
      @message_recieved = @recipient.messages.build(params[:message])
      @message_sent.folder = "sent"
      @message_recieved.folder = "inbox"
      @message_recieved.thread_count = @message_sent.thread_count
      respond_to do |format|
        if @message_sent.update_attributes(params[:message]) &&
        @message_recieved.update_attributes(params[:message]) &&
        @message_sent.save && @message_recieved.save