app/controllers/users_controller.rb

  def show
   @user = User.find(params[:id])
   @horses = Horse.where(:user_id => @user.id, :active => true).paginate(:page => params[:page], :per_page => 3)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "horses".* FROM "horses" WHERE "horses"."user_id" = 3